price = input("Вартісьть товару: ")
price = int(price)

taken = input('Отримано від покуця: ')
taken = int(taken)
здача = taken - price


if price > taken:
    print('дайте ще')
else:
    print('всьо ок')
    print('дякуюємо за покупки.Прихотьте ще.')
    print(f"Здача: {здача}")

решта_номінали = {
    '1': "Можна купюрами: 1",
    '2': "Можна купюрами: 2",
    '3': "Можна купюрами: 1і2",
    '4': "Можна купюрами: 2і2",
    '5': "Можна купюрами: 5",
    '6': "Можна купюрами: 1 і 5",
    '7': "Можна купюрами: 5 і 2",
    '8': "Можна купюрами: 5 ,1 і 2",
    '9': "Можна купюрами: 5 , 2і 2",
    '10': "Можна купюрами: 10",
    '11': "Можна купюрами: 10і1",
    '12': "Можна купюрами: 10і2",
    '13': "Можна купюрами: 10,2і1,",
    '14': "Можна купюрами: 10,2і2",
    '15': "Можна купюрами: 10і5",
    '16': "Можна купюрами: 10,5і1",
    '17': "Можна купюрами: 10,5і2",
    '18': "Можна купюрами: 10,5,2і1",
    '19': "Можна купюрами: 10,5,2і2",
    '20': "Можна купюрами: 20",
    '21': "Можна купюрами: 20і1",
    '22': "Можна купюрами: 20і2",
    '23': "Можна купюрами: 20,2і1"
}

if str(здача) in решта_номінали:
    print(решта_номінали.get(str(здача)))
else:
    print("Рахуйте самі !")
