price = input("Вартісьть товару: ")
price = int(price)

taken = input('Отримано від покуця: ')
taken = int(taken)
здача = taken - price


if price > taken:
    print('дайте ще')
else:
    print('всьо ок')
    print('дякуюємо за покупки.Прихотьте ще.')
    print(f"Здача: {здача}")

if здача == 1:
    print("Можна купюрами: 1")


if здача == 2:
    print("Можна купюрами: 2")

if здача == 3:
    print("Можна купюрами: 2 і 1")

if здача == 4:
    print("Можна купюрами: 2 і 2")

if здача == 5:
    print("Можна купюрами: 5")

if здача == 6:
    print("Можна купюрами: 5 і 1")

if здача == 7:
    print("Можна купюрами: 5 і 2")

if здача == 8:
    print("Можна купюрами: 5 і 3")

if здача == 9:
    print("Можна купюрами: 5 і 4")

if здача == 10:
    print("Можна купюрами: 10")

if здача == 11:
    print("Можна купюрами: 10 і 1")

if здача == 12:
    print("Можна купюрами: 10 і 2")

if здача == 13:
    print("Можна купюрами: 10, 2 і 1")

if здача == 14:
    print("Можна купюрами: 10, 2 і 2")

if здача == 15:
    print("Можна купюрами: 10 і 5")

if здача == 16:
    print("Можна купюрами: 10, 5 і 1")

if здача == 17:
    print("Можна купюрами: 10, 5 і 2")

if здача == 18:
    print("Можна купюрами: 10, 5 і 3")

if здача == 19:
    print("Можна купюрами: 10, 5 і 4")

if здача == 20:
    print("Можна купюрами: 20")

if здача == 21:
    print("Можна купюрами: 20 і 1")
